/**
 * Java Start. Home Work 06.
 *
 * @author Oleg Khrulov
 * @version dated 19.03.2019
 */

/*
        Написать код, который позволит менять и читать значения
        произвольных битов в массиве int-ов.
*/

package HW06;

public class MainHW06Task04 {
    public static void main(String[] args) {
        System.out.println("Hello!");
    }
}
