/**
 * Java Start. Home Work 07.
 *
 * @author Oleg Khrulov
 * @version dated 10.03.2019
 */

/*
        Дано текст и определенное слово. Посчитать сколько раз
        заданное слово встречается в тексте.
*/

package HW07;

public class MainHW07Task02 {
    public static void main(String[] args) {
        System.out.println("Hello!");
    }
}