/**
 * Java Start. Home Work 07.
 *
 * @author Oleg Khrulov
 * @version dated 10.03.2019
 */

/*
        Дано текст. Убрать лишние пробелы, расставить знаки
        препинания. Пример: «Я длинное предложение Я
        второе предложение.» -> «Я длинное предложение. Я
        второе предложение.»
*/

package HW07;

public class MainHW07Task04 {
    public static void main(String[] args) {
        System.out.println("Hello!");
    }
}