/**
 * Java Start. Home Work 07.
 *
 * @author Oleg Khrulov
 * @version dated 10.03.2019
 */

/*
        Дано текст из 3-х слов “word1 word2 word3”. Поменять 1-е
        и 3-е слова местами и вывести на экран результат.
*/

package HW07;

public class MainHW07Task01 {
    public static void main(String[] args) {
        System.out.println("Hello!");
    }
}